In [ ]:
#Pandas Library

In [8]:
#Series ------ one-dimensional labeled array.
import pandas as pd

#Each element has a label
s = pd.Series([10, 20, 30, 40], index=['a', 'b', 'c', 'd'])
print(s)

a    10
b    20
c    30
d    40
dtype: int64

In [10]:
import pandas as pd
#without initializing labels become 0,1,2----
data=pd.Series(['apple','bannana','mango','grapes','pineapple'])
print(data)

0        apple
1      bannana
2        mango
3       grapes
4    pineapple
dtype: object

In [7]:
#dataframes
import pandas as pd

print('-----data frame-----')

data={
    'students':['kashaf','salva','abrish'],
    'grade':[70,90,100],
    'DEPARTMENT':['COMPUTER SYSTEM','CIVIL','MEDICAL']
}
df=pd.DataFrame(data)
print(df)

-----data frame-----
  students  grade       DEPARTMENT
0   kashaf     70  COMPUTER SYSTEM
1    salva     90            CIVIL
2   abrish    100          MEDICAL
  students  grade
0   kashaf     70
1    salva     90
2   abrish    100
  students  grade DEPARTMENT
1    salva     90      CIVIL
2   abrish    100    MEDICAL

In [11]:
#Selection and Indexing---- selecting columns
#to print only grades and students
print(df[['students','grade']])

  students  grade
0   kashaf     70
1    salva     90
2   abrish    100
  students  grade DEPARTMENT
1    salva     90      CIVIL
2   abrish    100    MEDICAL

In [16]:
#selecting rows ----- By index (loc):
df.loc[0:2]       #from 0 to 2

  students  grade       DEPARTMENT
0   kashaf     70  COMPUTER SYSTEM
1    salva     90            CIVIL
2   abrish    100          MEDICAL

In [18]:
#conditional sentences 
print(df[df['grade']>70])

  students  grade DEPARTMENT
1    salva     90      CIVIL
2   abrish    100    MEDICAL

In [22]:
#Operations on DataFrames
#head() and tail()
print (df.head(2) )  # First 2 rows
print( "\n",df.tail(1) )  # Last 1 rows

  students  grade       DEPARTMENT
0   kashaf     70  COMPUTER SYSTEM
1    salva     90            CIVIL

   students  grade DEPARTMENT
2   abrish    100    MEDICAL

In [24]:
#sorting
df.sort_values('grade', ascending=False)

  students  grade       DEPARTMENT
2   abrish    100          MEDICAL
1    salva     90            CIVIL
0   kashaf     70  COMPUTER SYSTEM

In [26]:
#null value check
df.isnull()   #flase means no null value

   students  grade  DEPARTMENT
0     False  False       False
1     False  False       False
2     False  False       False

In [ ]:
#Data Input

#From CSV
df = pd.read_csv("file.csv")

#From Excel
df = pd.read_excel("file.xlsx")

#From Dictionary/List:
df = pd.DataFrame({'col1': [1, 2], 'col2': [3, 4]})